[{
  "_id": {
    "$oid": "61b1cbcea33addc6e47a3079"
  },
  "name": "Research Update: Utility Token Design",
  "content": "By Samuel Häfner, Web3 Foundation Research Scientist\nNew Web3 Foundation research on utility token design shows that, unlike centralized web2 platforms that favor the interests of the platform, decentralized utility token ecosystems are generally efficient, resulting in the optimal provision of services for all ecosystem participants. It also highlights a tension referred to as the ‘utility token trilemma’ and demonstrates that Polkadot’s utility token model is sustainable, resulting in optimal dynamics for the entire community of network participants.\nBased on the definition provided by FINMA in its Guidelines issued in February 2018, utility tokens are “tokens which are intended to provide access digitally to an application or service by means of a blockchain-based infrastructure.”\nThe services offered by the Polkadot network consist of parachain slots, which come with shared security and technological means to communicate with other parachains in the network. To obtain one of the slots, the users — i.e., the teams building on Polkadot — need to put forth DOT in recurrent slot auctions.\nWhat is common to many utility token-based projects is that the respective utility tokens are native to their own blockchain. That means that the tokens are not only required to consume services but also serve to incentivize consensus provision by network nodes. This two-fold role gives rise to some delicate design issues, which I explore in my recent research paper “Utility Token Design.”\nIn the paper, I analyze a dynamic general equilibrium model of utility tokens that are native to a proof-of-stake blockchain. Historically, dynamic general equilibrium models have been used to explain supply and demand in a whole economy. Utility token markets share some features with whole economies because they also have users, producers (mainly network nodes which “produce” security of the blockchain), and their own incentives.\nI make two main observations about utility token dynamics. First, I find that utility token ecosystems are generally efficient because they result in the socially optimal provision of services. Second, I uncover a tension between the value dynamics of utility tokens, the evolution of the provided services, and the incentive details on the users’ side.\nThe Model\nThis section describes the theoretical framework of a general utility token ecosystem. A reader not interested in technicalities may skip it and go directly to the next section, which discusses the main results.\nI set up a dynamic model of utility tokens on a two-sided platform. Platforms are special markets that are designed to bring together different kinds of market participants and let them realize network gains. Traditional platforms include UBER (matching drivers and riders) and Amazon Marketplace (matching sellers and buyers).\nIn my model, the platform develops and maintains the software (usually referred to as the runtime in blockchain terminology), which is required for service provision and is run by the validators. To cover the costs of doing so, the platform repeatedly sells utility tokens on the market.\nOn the one side of the platform that I consider, there is a fixed number of users, who repeatedly utilize tokens in order to consume services. Consumption is rivalrous, and the consumption utility that a user obtains is increasing in its share of total tokens put forth by all the users. Basically, the throughput of any blockchain network is limited, yet the more tokens you hold the higher is your chance of obtaining the fruition of a certain service, such as a parachain slot on Polkadot.\nOn the other side, there is a fixed number of validators, who obtain rewards for providing security and need to repeatedly sell some of their rewards to cover their costs. Validators never want to forgo all their tokens, though. They face a tradeoff, because the share of the rewards that they obtain increases in their share of the total token holdings among all validators. This reflects the proof-of-stake nature of the blockchain: your rewards as a validator are proportional to your share of the network.\nThe model assumes that the token ecosystem is in a long-term equilibrium. This means that the number of network participants remains constant over time and that any speculative use of the tokens is absent; i.e., that the tokens are merely used to consume the services of the platform.\nThe resulting utility token value plays an important role in this setup because it needs to balance the incentives of the users and the validators. If today’s value is too high relative to tomorrow’s value, then users will only buy a few utility tokens to use the services, validators can't cover their infrastructure costs, and the network breaks down. On the other hand, if today’s value is too low relative to tomorrow’s value, then validators might not get enough from the disposal of their tokens, either, and stop working. Increasing values might result when users expect the value of the blockchain services to grow fast over time. Decreasing values might result when the blockchain platform has high future costs to maintain the blockchain and thus too many tokens need to be sold.\nThe platform has a couple of options to influence the supply and demand of tokens. First, it can set the staking rewards that are allocated over the rounds. Second, it can choose the quality of services, and thus the consumption utility of the users. And third, the platform can decide whether the tokens users put forth for consumption are bonded (i.e., returned after every round, as is the case for Polkadot) or spent (i.e., deducted from a user's token holdings, as is the case for many smart-contract chains).\nEquilirium in this setting is a token value together with strategies for the users, validators, and the platform which are mutually optimal. Any equilibrium must have a constant staking rate, which is required on proof-of-stake blockchains for security reasons.\nFindings\nThe most important finding is that, even though the blockchain platform is modeled as a monopolist both on the user side as well as on the validator side (i.e., it does not face competition from other platforms), there are equilibria in which it chooses the socially optimal level of services. That is, by selecting for the individually optimal level of services, the platform chooses a quality level that is also optimal for everyone.\nSuch a finding might be surprising given what we know about classical two-sided platforms. Examples of classical two-sided platforms include UBER, Amazon, and the iOS App Store. All these platforms match two sides of the market (drivers and passengers, merchants and customers, app developers and users), thus realizing gains from network effects. Nevertheless, we observe that it is usually not in the interest of the platforms that all gains are realized. Rather, platforms are known to distort the prices of their services and/or the quantity of their services in a way that reduces the welfare of the platform participants while maximizing the interests of the platform.\nHowever, if we appreciate the effects of decentralization, then the finding that utility token ecosystems produce the efficient outcome is not too surprising. It is a hallmark of utility token platforms that the prices of the services are not fixed by the protocol but rather competitively determined by the users. In Polkadot, the amount of tokens required to obtain a parachain slot is determined in auctions; in Ethereum the tips that the users attach to their transactions determine how fast they are included in a block.\n\nIf the platform has no influence on the price of its services, then it seeks to optimally choose the quality of the provided services. The main contribution of the paper is to show that there is a competitive equilibrium in which it does so efficiently. Technically, this is achieved by formulating equilibrium strategies for the validators and users under which they adapt their token-usage decisions such that their utility remains invariant in the service quality, leading the platform to choose the service quality that maximizes total welfare.\n\nThe second main result of the paper is a “utility token trilemma”, characterizing the set of possible equilibria. The trilemma says that only two of the following three features can hold in equilibrium: (i) bonding of users' tokens, (ii) a constant token value, (iii) a constant value of the provided services.\n\nIntuitively, if features (ii) and (iii) hold, then the tokens that the users optimally hold today are the same as they want to hold tomorrow. Now, if in addition, the users get their tokens back after consumption (which is a consequence of feature (i)), then there would be no demand from the users for tokens. But this would in turn imply that neither the validators nor the blockchain platform make any profit.\n\nThe result implies that, in reality, we can only expect utility token designs in which at most two of these three features are present. A design with all three features just won’t work. From a practical token design perspective, however, each of the three features is likely to be valuable on its own.\n\nFirst, consider value stability.  Declining values can be somewhat counteracted by increasing the service quality over time, or by taking some of the users’ tokens out of circulation in every round. Either way, having a business model that builds on value stability certainly has some appeal from a psychological perspective — certainly more so than a platform that is known to constantly dilute its token value.\nSecond, consider token bonding. Under a bonding scheme, the tokens that users put forth to consume services are locked while doing so and returned afterward. So, their holdings do not diminish over time, which in turn might give users a better sense of what they can do with their tokens. Moreover, bonding can act as a substitute for staking; i.e., similar to staked tokens, bonded tokens represent direct participation in the ecosystem for their holders, reduce the liquid tokens in circulation, and are thus valuable from a security perspective.\n\nLast, consider constant service quality. Having a constant blockchain value is a natural necessity for many projects: A business model that relies on a declining value proposition might attract skepticism, while a business model that relies on ever-increasing blockchain values might similarly invite questions of sustainability. In particular, one might be worried that the costs of providing ever-increasing service quality might grow too fast to be sustainable.\n\nRelevance for Polkadot\nThe main takeaway from the above results is that the general setup of Polkadot is sustainable. The token value is reflective of the portion of services a DOT can buy. The parachain auctions generate token demand that will be met by the supply of the validators, keeping the system going.\n\nAnother general takeaway is that there should be little concern that decentralized platforms like Polkadot will abuse their power. The reasoning is as follows: since such platforms don’t set an explicit price for their services but rather let their users compete for them, it cannot engage in anti-competitive price-setting behavior by design. So, the question is whether a platform would ever want to provide an inefficient service quality. The analysis in the paper shows that the answer is no. Specifically, it shows that there are equilibria in which it is in the best interest of the platform to choose the socially optimal quality of services.\n\nNow clearly, Polkadot does not have a single platform designer but is community-led with a clear governance process. Whereas the model abstracts from this, the conclusion carries over. We may take the platform designer as a third set of stakeholders, namely software developers, that together with the users and the validators decide on the further development of the services and then implement these community decisions. The analysis shows that the overall goal of the developers is aligned with that of the users and the validators: to maximize social output. How exactly the generated surplus is distributed among the different stakeholders is, of course, subject to governance.\n\nOne indication that Polkadot indeed gives more incentives to users and validators than is necessary to keep the system self-sustained is the fact that it employs a bonding scheme for the bids in the parachain auctions. The analysis in the paper shows that the platform-optimal equilibrium (i.e., the equilibrium in which platform profit would be maximized) does not involve the bonding of users’ tokens. (The reason being that, if users’ tokens are bonded rather than spent, then this reduces token demand from the users’ side, which is bad news for the platform that needs to sell tokens.) As a consequence, Polkadot must be in an equilibrium that is different from the platform-optimal equilibrium. But this means that the value added by Polkadot is exactly where it should be: with the community.",
  "createAt": {
    "$date": "2000-12-31T17:00:00Z"
  },
  "status": [
    "Up",
    "DOwn"
  ],
  "thumbnail": "https://polkadot.network/content/images/2021/11/Utility_tokens.png",
  "updateAt": {
    "$date": "2000-12-31T17:00:00Z"
  }
},{
  "_id": {
    "$oid": "61b1fb70e1921a8c5ef3bfaf"
  },
  "name": "Rococo Revamp – Becoming a Community",
  "content": "By Samuel Häfner, Web3 Foundation Research Scientist\nNew Web3 Foundation research on utility token design shows that, unlike centralized web2 platforms that favor the interests of the platform, decentralized utility token ecosystems are generally efficient, resulting in the optimal provision of services for all ecosystem participants. It also highlights a tension referred to as the ‘utility token trilemma’ and demonstrates that Polkadot’s utility token model is sustainable, resulting in optimal dynamics for the entire community of network participants.\nBased on the definition provided by FINMA in its Guidelines issued in February 2018, utility tokens are “tokens which are intended to provide access digitally to an application or service by means of a blockchain-based infrastructure.”\nThe services offered by the Polkadot network consist of parachain slots, which come with shared security and technological means to communicate with other parachains in the network. To obtain one of the slots, the users — i.e., the teams building on Polkadot — need to put forth DOT in recurrent slot auctions.\nWhat is common to many utility token-based projects is that the respective utility tokens are native to their own blockchain. That means that the tokens are not only required to consume services but also serve to incentivize consensus provision by network nodes. This two-fold role gives rise to some delicate design issues, which I explore in my recent research paper “Utility Token Design.”\nIn the paper, I analyze a dynamic general equilibrium model of utility tokens that are native to a proof-of-stake blockchain. Historically, dynamic general equilibrium models have been used to explain supply and demand in a whole economy. Utility token markets share some features with whole economies because they also have users, producers (mainly network nodes which “produce” security of the blockchain), and their own incentives.\nI make two main observations about utility token dynamics. First, I find that utility token ecosystems are generally efficient because they result in the socially optimal provision of services. Second, I uncover a tension between the value dynamics of utility tokens, the evolution of the provided services, and the incentive details on the users’ side.\nThe Model\nThis section describes the theoretical framework of a general utility token ecosystem. A reader not interested in technicalities may skip it and go directly to the next section, which discusses the main results.\nI set up a dynamic model of utility tokens on a two-sided platform. Platforms are special markets that are designed to bring together different kinds of market participants and let them realize network gains. Traditional platforms include UBER (matching drivers and riders) and Amazon Marketplace (matching sellers and buyers).\nIn my model, the platform develops and maintains the software (usually referred to as the runtime in blockchain terminology), which is required for service provision and is run by the validators. To cover the costs of doing so, the platform repeatedly sells utility tokens on the market.\nOn the one side of the platform that I consider, there is a fixed number of users, who repeatedly utilize tokens in order to consume services. Consumption is rivalrous, and the consumption utility that a user obtains is increasing in its share of total tokens put forth by all the users. Basically, the throughput of any blockchain network is limited, yet the more tokens you hold the higher is your chance of obtaining the fruition of a certain service, such as a parachain slot on Polkadot.\nOn the other side, there is a fixed number of validators, who obtain rewards for providing security and need to repeatedly sell some of their rewards to cover their costs. Validators never want to forgo all their tokens, though. They face a tradeoff, because the share of the rewards that they obtain increases in their share of the total token holdings among all validators. This reflects the proof-of-stake nature of the blockchain: your rewards as a validator are proportional to your share of the network.\nThe model assumes that the token ecosystem is in a long-term equilibrium. This means that the number of network participants remains constant over time and that any speculative use of the tokens is absent; i.e., that the tokens are merely used to consume the services of the platform.\nThe resulting utility token value plays an important role in this setup because it needs to balance the incentives of the users and the validators. If today’s value is too high relative to tomorrow’s value, then users will only buy a few utility tokens to use the services, validators can't cover their infrastructure costs, and the network breaks down. On the other hand, if today’s value is too low relative to tomorrow’s value, then validators might not get enough from the disposal of their tokens, either, and stop working. Increasing values might result when users expect the value of the blockchain services to grow fast over time. Decreasing values might result when the blockchain platform has high future costs to maintain the blockchain and thus too many tokens need to be sold.\nThe platform has a couple of options to influence the supply and demand of tokens. First, it can set the staking rewards that are allocated over the rounds. Second, it can choose the quality of services, and thus the consumption utility of the users. And third, the platform can decide whether the tokens users put forth for consumption are bonded (i.e., returned after every round, as is the case for Polkadot) or spent (i.e., deducted from a user's token holdings, as is the case for many smart-contract chains).\nEquilirium in this setting is a token value together with strategies for the users, validators, and the platform which are mutually optimal. Any equilibrium must have a constant staking rate, which is required on proof-of-stake blockchains for security reasons.\nFindings\nThe most important finding is that, even though the blockchain platform is modeled as a monopolist both on the user side as well as on the validator side (i.e., it does not face competition from other platforms), there are equilibria in which it chooses the socially optimal level of services. That is, by selecting for the individually optimal level of services, the platform chooses a quality level that is also optimal for everyone.\nSuch a finding might be surprising given what we know about classical two-sided platforms. Examples of classical two-sided platforms include UBER, Amazon, and the iOS App Store. All these platforms match two sides of the market (drivers and passengers, merchants and customers, app developers and users), thus realizing gains from network effects. Nevertheless, we observe that it is usually not in the interest of the platforms that all gains are realized. Rather, platforms are known to distort the prices of their services and/or the quantity of their services in a way that reduces the welfare of the platform participants while maximizing the interests of the platform.\nHowever, if we appreciate the effects of decentralization, then the finding that utility token ecosystems produce the efficient outcome is not too surprising. It is a hallmark of utility token platforms that the prices of the services are not fixed by the protocol but rather competitively determined by the users. In Polkadot, the amount of tokens required to obtain a parachain slot is determined in auctions; in Ethereum the tips that the users attach to their transactions determine how fast they are included in a block.\n\nIf the platform has no influence on the price of its services, then it seeks to optimally choose the quality of the provided services. The main contribution of the paper is to show that there is a competitive equilibrium in which it does so efficiently. Technically, this is achieved by formulating equilibrium strategies for the validators and users under which they adapt their token-usage decisions such that their utility remains invariant in the service quality, leading the platform to choose the service quality that maximizes total welfare.\n\nThe second main result of the paper is a “utility token trilemma”, characterizing the set of possible equilibria. The trilemma says that only two of the following three features can hold in equilibrium: (i) bonding of users' tokens, (ii) a constant token value, (iii) a constant value of the provided services.\n\nIntuitively, if features (ii) and (iii) hold, then the tokens that the users optimally hold today are the same as they want to hold tomorrow. Now, if in addition, the users get their tokens back after consumption (which is a consequence of feature (i)), then there would be no demand from the users for tokens. But this would in turn imply that neither the validators nor the blockchain platform make any profit.\n\nThe result implies that, in reality, we can only expect utility token designs in which at most two of these three features are present. A design with all three features just won’t work. From a practical token design perspective, however, each of the three features is likely to be valuable on its own.\n\nFirst, consider value stability.  Declining values can be somewhat counteracted by increasing the service quality over time, or by taking some of the users’ tokens out of circulation in every round. Either way, having a business model that builds on value stability certainly has some appeal from a psychological perspective — certainly more so than a platform that is known to constantly dilute its token value.\nSecond, consider token bonding. Under a bonding scheme, the tokens that users put forth to consume services are locked while doing so and returned afterward. So, their holdings do not diminish over time, which in turn might give users a better sense of what they can do with their tokens. Moreover, bonding can act as a substitute for staking; i.e., similar to staked tokens, bonded tokens represent direct participation in the ecosystem for their holders, reduce the liquid tokens in circulation, and are thus valuable from a security perspective.\n\nLast, consider constant service quality. Having a constant blockchain value is a natural necessity for many projects: A business model that relies on a declining value proposition might attract skepticism, while a business model that relies on ever-increasing blockchain values might similarly invite questions of sustainability. In particular, one might be worried that the costs of providing ever-increasing service quality might grow too fast to be sustainable.\n\nRelevance for Polkadot\nThe main takeaway from the above results is that the general setup of Polkadot is sustainable. The token value is reflective of the portion of services a DOT can buy. The parachain auctions generate token demand that will be met by the supply of the validators, keeping the system going.\n\nAnother general takeaway is that there should be little concern that decentralized platforms like Polkadot will abuse their power. The reasoning is as follows: since such platforms don’t set an explicit price for their services but rather let their users compete for them, it cannot engage in anti-competitive price-setting behavior by design. So, the question is whether a platform would ever want to provide an inefficient service quality. The analysis in the paper shows that the answer is no. Specifically, it shows that there are equilibria in which it is in the best interest of the platform to choose the socially optimal quality of services.\n\nNow clearly, Polkadot does not have a single platform designer but is community-led with a clear governance process. Whereas the model abstracts from this, the conclusion carries over. We may take the platform designer as a third set of stakeholders, namely software developers, that together with the users and the validators decide on the further development of the services and then implement these community decisions. The analysis shows that the overall goal of the developers is aligned with that of the users and the validators: to maximize social output. How exactly the generated surplus is distributed among the different stakeholders is, of course, subject to governance.\n\nOne indication that Polkadot indeed gives more incentives to users and validators than is necessary to keep the system self-sustained is the fact that it employs a bonding scheme for the bids in the parachain auctions. The analysis in the paper shows that the platform-optimal equilibrium (i.e., the equilibrium in which platform profit would be maximized) does not involve the bonding of users’ tokens. (The reason being that, if users’ tokens are bonded rather than spent, then this reduces token demand from the users’ side, which is bad news for the platform that needs to sell tokens.) As a consequence, Polkadot must be in an equilibrium that is different from the platform-optimal equilibrium. But this means that the value added by Polkadot is exactly where it should be: with the community.",
  "createAt": {
    "$date": "2000-12-31T17:00:00Z"
  },
  "status": [
    "Up",
    "DOwn"
  ],
  "thumbnail": "https://polkadot.network/content/images/2021/10/rococo.png",
  "updateAt": {
    "$date": "2000-12-31T17:00:00Z"
  }
}]